Revit 2021.1 API
FabricationConfigurationInfo.IsConnected Property
 whether the remote cloud configuration is connected and can be loaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2019
Syntax
C#
public bool IsConnected { get; }
Visual Basic
Public ReadOnly Property IsConnected As Boolean
	Get
Visual C++
public:
property bool IsConnected {
	bool get ();
}
See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace